Documents/КорректировкаЗначенийЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КорректировкаЗначенийЛимитов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛимитыБюджетированияПоСтатьям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьиДДСКратко</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БДДСУменьшение</Name>
					<Comment>Данные бюджета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Comment>Проект</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VatNoVat</Name>
							<Type>
								<v8:Type>cfg:EnumRef.VatNoVat</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БДДСУвеличение</Name>
					<Comment>Данные бюджета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Comment>Проект</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VatNoVat</Name>
							<Type>
								<v8:Type>cfg:EnumRef.VatNoVat</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПериодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛимитыБюджетированияПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыБюджетированияПоСтатьям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>VatNoVat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VatNoVat</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Стаття</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПериодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроектУправленческий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыПериодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТриМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОграничений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаЗначенийЛимитов/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Организация,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Подразделение КАК ЦФО,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Статья КАК СтатьяДДС,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Проект КАК Проект,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Период,
	               |	СУММА(ЛимитыБюджетированияПоСтатьямОбороты.СуммаОборот) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛимитыБюджетированияПоСтатьям.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Месяц,
	               |			Подразделение = &ЦФО
	               |				И Организация = &Организация) КАК ЛимитыБюджетированияПоСтатьямОбороты
	               |ГДЕ
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода <> &ТипПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Организация,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Статья,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Подразделение,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Проект,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.ТипПериода,
	               |	ЛимитыБюджетированияПоСтатьямОбороты.Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоГода(Параметры.Дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецГода(Параметры.Дата));

	
	Запрос.УстановитьПараметр("ЦФО",Параметры.ЦФО);
	Запрос.УстановитьПараметр("ТипПериода",Перечисления.ТипыПериодов.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация",Параметры.Организация);
	
	ОстаткиЛимитов= Запрос.Выполнить().Выгрузить();
	
	Результат.Загрузить(ОстаткиЛимитов);
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтрукутураВозврата = новый Структура;
	СтрукутураВозврата.Вставить("ЦФО",Элементы.Результат.ТекущиеДанные.ЦФО);
	СтрукутураВозврата.Вставить("СтатьяДДС",Элементы.Результат.ТекущиеДанные.СтатьяДДС);
	СтрукутураВозврата.Вставить("Проект",Элементы.Результат.ТекущиеДанные.Проект);
	СтрукутураВозврата.Вставить("ТипПериода",Элементы.Результат.ТекущиеДанные.ТипПериода);
	СтрукутураВозврата.Вставить("Период",Элементы.Результат.ТекущиеДанные.Период);
	СтрукутураВозврата.Вставить("Сумма",Элементы.Результат.ТекущиеДанные.Сумма);

	ОповеститьОВыборе(СтрукутураВозврата);
КонецПроцедуры
